[
  {
    "_id": "5001",
    "name": "CS5001 Foundations in CS",
    "number": "CS5001",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "Computer Science",
    "credits": 4,
    "description": "This course covers the fundamental concepts of computer science. Topics include basic programming, algorithms, data structures, software development, and computer systems. It is designed for students with little to no prior experience in computer science, aiming to build a solid foundation for further study in the field.",
    "image": "/images/cs5001_logo.jpg"
  },
  {
    "_id": "5002",
    "name": "CS5002 Discrete Structures",
    "number": "CS5002",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "Computer Science",
    "credits": 3,
    "description": "This course introduces the mathematical structures that form the foundation of computer science. Topics include logic, set theory, combinatorics, graph theory, and finite automata. The course emphasizes problem-solving and the application of mathematical concepts to computing problems.",
    "image": "/images/cs5002_logo.jpg"
  },
  {
    "_id": "5004",
    "name": "CS5004 Object Oriented Design",
    "number": "CS5004",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "Computer Science",
    "credits": 4,
    "description": "This course focuses on the principles and practices of object-oriented design. Topics include object-oriented programming languages, design patterns, UML diagrams, and software development methodologies. Students will learn to design and implement complex software systems using object-oriented techniques.",
    "image": "/images/cs5004_logo.jpg"
  },
  {
    "_id": "5008",
    "name": "CS5008 Data Structures",
    "number": "CS5008",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "Computer Science",
    "credits": 4,
    "description": "This course explores the fundamental data structures used in computer science, including arrays, linked lists, stacks, queues, trees, and graphs. Students will learn about the algorithms associated with these data structures and their applications in solving computational problems.",
    "image": "/images/cs5008_logo.jpg"
  },
  {
    "_id": "5800",
    "name": "CS5800 Algorithms",
    "number": "CS5800",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "Computer Science",
    "credits": 4,
    "description": "This course provides an in-depth study of algorithms, focusing on their design, analysis, and implementation. Topics include sorting and searching algorithms, dynamic programming, greedy algorithms, graph algorithms, and computational complexity. The course emphasizes the development of efficient algorithms to solve real-world problems.",
    "image": "/images/cs5800_logo.jpg"
  },
  {
    "_id": "5200",
    "name": "CS5200 Database Management Systems",
    "number": "CS5200",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "Computer Science",
    "credits": 4,
    "description": "This course covers the principles and practices of database management systems. Topics include data modeling, relational databases, SQL, transaction management, and database security. Students will learn to design, implement, and manage databases to support various applications.",
    "image": "/images/cs5200_logo.jpg"
  },
  {
    "_id": "5610",
    "name": "CS5610 Web Development",
    "number": "CS5610",
    "startDate": "2023-01-10",
    "endDate": "2023-05-15",
    "department": "Computer Science",
    "credits": 4,
    "description": "This course provides a comprehensive introduction to web development. Topics include HTML, CSS, JavaScript, front-end frameworks, back-end development, and web security. Students will learn to create dynamic and responsive web applications using modern web technologies.",
    "image": "/images/cs5610_logo.jpg"
  }
]
